데이터 불러왔을 때 한글 깨지는 경우:   encoding='cp949'

In [6]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
s1.index
print(s1.index)

RangeIndex(start=0, stop=5, step=1)

In [4]:
s1.values

array([10, 20, 30, 40, 50])

In [5]:
s2 = pd.Series(['a','b','c',1,2,3])
s2

0    a
1    b
2    c
3    1
4    2
5    3
dtype: object

In [7]:

s3 = pd.Series([np.nan,10,30])
s3

0     NaN
1    10.0
2    30.0
dtype: float64

In [12]:
index_data = ['20181007','20181008','20181009','20181010']
s4 = pd.Series([200,195,203,242],index = index_data)
s4

20181007    200
20181008    195
20181009    203
20181010    242
dtype: int64

In [13]:
#dict사용
s5 = pd.Series({'국어':100,'영어':80,'수학': 99})
s5

국어    100
영어     80
수학     99
dtype: int64

In [14]:
#날짜 자동생성
pd.date_range(start='2019-01-01',end='2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [15]:
pd.date_range(start='2019-01-01',periods=7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [16]:
#증가하는 날짜 설정가능 (D하루, B업무날짜기준 하루, 책243페이지 참고)
pd.date_range(start='2019-01-01',periods=4,freq='2D')

DatetimeIndex(['2019-01-01', '2019-01-03', '2019-01-05', '2019-01-07'], dtype='datetime64[ns]', freq='2D')

## Date Frame 활용

In [22]:
import pandas as pd
a = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
a

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
data_list = np.array([[10,20,30],[40,50,60],[70,80,90]])
pd.DataFrame(data_list)

    0   1   2
0  10  20  30
1  40  50  60
2  70  80  90

In [24]:
data = np.array([[1,2,3],[4,5,6],[7,8,9],[10,11,12]])
index_data = pd.date_range('2019-01-01',periods=4)
columns_list = ['A','B','C']
pd.DataFrame(data, index=index_data,columns=columns_list)

             A   B   C
2019-01-01   1   2   3
2019-01-02   4   5   6
2019-01-03   7   8   9
2019-01-04  10  11  12

## 데이터 연산

In [25]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([10,20,30,40,50])
s1 + s2

0    11
1    22
2    33
3    44
4    55
dtype: int64

In [26]:
s2-s1

0     9
1    18
2    27
3    36
4    45
dtype: int64

In [27]:
s1*s2

0     10
1     40
2     90
3    160
4    250
dtype: int64

In [28]:
s2/s1

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
dtype: float64

In [29]:
s3 = pd.Series([1,2,3,4])
s4 = pd.Series([10,20,30,40,50])
s3+s4

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [30]:
table_data1 = {'A':[1,2,3,4,5],'B':[10,20,30,40,50],'C':[100,200,300,400,500]}
df1 = pd.DataFrame(table_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [31]:
table_data2 = {'A':[6,7,8],'B':[60,70,80],'C':[600,700,800]}
df2 = pd.DataFrame(table_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800

In [32]:
df1 + df2

      A      B       C
0   7.0   70.0   700.0
1   9.0   90.0   900.0
2  11.0  110.0  1100.0
3   NaN    NaN     NaN
4   NaN    NaN     NaN

## 데이터 원하는 대로 선택

In [35]:
KTX_data = {'경부선 KTX':[39060,39896,42005,43621,41702,41266,32427],
           '호남선 KTX':[7313,6967,6873,6626,8675,10622,9228],
           '경전선 KTX':[3627,2312,3634,3423,5356,9238,29423],
           '전라선 KTX':[223,2452,1213,777,463,1231,6235],
           '동해선 KTX':[np.nan,np.nan,np.nan,np.nan,2139,3740,3425]}
col_list = ['경부선 KTX','호남선 KTX','경전선 KTX','전라선 KTX','동해선 KTX']
index_list = ['2011','2012','2013','2014','2015','2016','2017']
df_KTX = pd.DataFrame(KTX_data,columns=col_list, index = index_list)
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      223      NaN
2012    39896     6967     2312     2452      NaN
2013    42005     6873     3634     1213      NaN
2014    43621     6626     3423      777      NaN
2015    41702     8675     5356      463   2139.0
2016    41266    10622     9238     1231   3740.0
2017    32427     9228    29423     6235   3425.0

In [36]:
df_KTX.index

Index(['2011', '2012', '2013', '2014', '2015', '2016', '2017'], dtype='object')

In [37]:
df_KTX.columns

Index(['경부선 KTX', '호남선 KTX', '경전선 KTX', '전라선 KTX', '동해선 KTX'], dtype='object')

In [38]:
df_KTX.values

array([[39060.,  7313.,  3627.,   223.,    nan],
       [39896.,  6967.,  2312.,  2452.,    nan],
       [42005.,  6873.,  3634.,  1213.,    nan],
       [43621.,  6626.,  3423.,   777.,    nan],
       [41702.,  8675.,  5356.,   463.,  2139.],
       [41266., 10622.,  9238.,  1231.,  3740.],
       [32427.,  9228., 29423.,  6235.,  3425.]])

In [39]:
df_KTX.head()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      223      NaN
2012    39896     6967     2312     2452      NaN
2013    42005     6873     3634     1213      NaN
2014    43621     6626     3423      777      NaN
2015    41702     8675     5356      463   2139.0

In [40]:
df_KTX.tail()

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     3634     1213      NaN
2014    43621     6626     3423      777      NaN
2015    41702     8675     5356      463   2139.0
2016    41266    10622     9238     1231   3740.0
2017    32427     9228    29423     6235   3425.0

In [41]:
#시작과 끝 위치
df_KTX[1:2]

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2012    39896     6967     2312     2452      NaN

In [42]:
# 항목 이름 행 데이터, 열도 가능
df_KTX.loc['2011']

경부선 KTX    39060.0
호남선 KTX     7313.0
경전선 KTX     3627.0
전라선 KTX      223.0
동해선 KTX        NaN
Name: 2011, dtype: float64

In [43]:
df_KTX.loc['2013':'2016']

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2013    42005     6873     3634     1213      NaN
2014    43621     6626     3423      777      NaN
2015    41702     8675     5356      463   2139.0
2016    41266    10622     9238     1231   3740.0

In [44]:
df_KTX['경부선 KTX']['2012':'2014']

2012    39896
2013    42005
2014    43621
Name: 경부선 KTX, dtype: int64

In [45]:
#전치 구하기
df_KTX.T

            2011     2012     2013     2014     2015     2016     2017
경부선 KTX  39060.0  39896.0  42005.0  43621.0  41702.0  41266.0  32427.0
호남선 KTX   7313.0   6967.0   6873.0   6626.0   8675.0  10622.0   9228.0
경전선 KTX   3627.0   2312.0   3634.0   3423.0   5356.0   9238.0  29423.0
전라선 KTX    223.0   2452.0   1213.0    777.0    463.0   1231.0   6235.0
동해선 KTX      NaN      NaN      NaN      NaN   2139.0   3740.0   3425.0

In [46]:
df_KTX

      경부선 KTX  호남선 KTX  경전선 KTX  전라선 KTX  동해선 KTX
2011    39060     7313     3627      223      NaN
2012    39896     6967     2312     2452      NaN
2013    42005     6873     3634     1213      NaN
2014    43621     6626     3423      777      NaN
2015    41702     8675     5356      463   2139.0
2016    41266    10622     9238     1231   3740.0
2017    32427     9228    29423     6235   3425.0

## 데이터 통합하기

In [47]:
#세로 방향으로 통합하기 : append()이용
df1 = pd.DataFrame({'Class1': [95,92,98,100],
                   'Class2': [91,93,97,99]})
df1

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99

In [57]:


df2 = pd.DataFrame({'Class1':[87,89]
                   ,'Class2':[85,90]})
df2

   Class1  Class2
0      87      85
1      89      90

In [58]:
df1.append(df2)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
0      87      85
1      89      90

In [59]:
# ignore_index=True 해야 순차적으로 index 증가
df1.append(df2,ignore_index=True)

   Class1  Class2
0      95      91
1      92      93
2      98      97
3     100      99
4      87      85
5      89      90

In [60]:
df3 = pd.DataFrame({'Class1':[96,83]})
df3

   Class1
0      96
1      83

In [61]:
# 없는 부분은 NaN으로 채워짐
df2.append(df3,ignore_index=True)

   Class1  Class2
0      87    85.0
1      89    90.0
2      96     NaN
3      83     NaN

In [62]:
# 가로 방향으로 통합 : join()이용
df4 = pd.DataFrame({'Class3':[93,91,95,98]})
df4

   Class3
0      93
1      91
2      95
3      98

In [63]:
df1.join(df4)

   Class1  Class2  Class3
0      95      91      93
1      92      93      91
2      98      97      95
3     100      99      98

In [64]:
#특정 열을 기준으로 통합하기 : merge()이용

df_A_B = pd.DataFrame({'판매월':['1월','2월','3월','4월'],
                      '제품A':[100,150,200,130],
                      '제품B':[90,110,140,170]})
df_A_B

  판매월  제품A  제품B
0  1월  100   90
1  2월  150  110
2  3월  200  140
3  4월  130  170

In [65]:
df_C_D = pd.DataFrame({'판매월':['1월','2월','3월','4월'],
                      '제품C':[112,141,203,134],
                      '제품D':[90,110,140,170]})
df_C_D

  판매월  제품C  제품D
0  1월  112   90
1  2월  141  110
2  3월  203  140
3  4월  134  170

In [66]:
df_A_B.merge(df_C_D)

  판매월  제품A  제품B  제품C  제품D
0  1월  100   90  112   90
1  2월  150  110  141  110
2  3월  200  140  203  140
3  4월  130  170  134  170

In [67]:
df_left = pd.DataFrame({'key':['A','B','C'],'left':[1,2,3]})
df_left

  key  left
0   A     1
1   B     2
2   C     3

In [71]:
df_right = pd.DataFrame({'key':['A','B','D'],'right':[4,5,6]})
df_right

  key  right
0   A      4
1   B      5
2   D      6

In [72]:
df_left.merge(df_right,how='left',on='key')

  key  left  right
0   A     1    4.0
1   B     2    5.0
2   C     3    NaN

In [73]:
df_left.merge(df_right,how='right',on='key')

  key  left  right
0   A   1.0      4
1   B   2.0      5
2   D   NaN      6

In [74]:
df_left.merge(df_right,how='outer',on='key')

  key  left  right
0   A   1.0    4.0
1   B   2.0    5.0
2   C   3.0    NaN
3   D   NaN    6.0

In [75]:
df_left.merge(df_right,how='inner',on='key')

  key  left  right
0   A     1      4
1   B     2      5

In [82]:
pd.read_csv('/Users/dongwook/Desktop/TIL/python/sea_rain1.csv')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [85]:
# 인코딩할 때 한글을 제대로 표현하려면, encoding = 'utf8' 혹은 encoding='cp949'
#  메모장에서 파일을 저장하면 인코딩 형식이  cp949가 된다.

pd.read_csv('/Users/dongwook/Desktop/TIL/python/sea_rain1.csv', encoding="utf8")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [89]:
# sep ="구분자"
pd.read_csv('/Users/dongwook/Desktop/TIL/python/sea_rain1_space.txt',sep=" ")

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

In [90]:
pd.read_csv('/Users/dongwook/Desktop/TIL/python/sea_rain1.csv',index_col='연도')

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

In [92]:
#표형식의 데이터를 파일로 쓰기
df_WH = pd.DataFrame({'Weight':[62,67,55,74],
                     'Height':[165,177,160,180]},
                     index=['ID_1','ID_2','ID_3','ID_4'])
df_WH.index.name = 'User'
df_WH

      Weight  Height
User
ID_1      62     165
ID_2      67     177
ID_3      55     160
ID_4      74     180

In [93]:
bmi = df_WH['Weight']/(df_WH['Height']/100)**2
bmi

User
ID_1    22.773186
ID_2    21.385936
ID_3    21.484375
ID_4    22.839506
dtype: float64

In [106]:
df_WH['BMI']=bmi
df_WH

      Weight  Height        BMI
User
ID_1      62     165  22.773186
ID_2      67     177  21.385936
ID_3      55     160  21.484375
ID_4      74     180  22.839506

In [114]:
df_WH.to_csv('/Users/dongwook/Desktop/TIL/python/save_DataFrame.csv')

In [115]:
!type /Users/dongwook/Desktop/TIL/python/save_DataFrame.csv

/Users/dongwook/Desktop/TIL/python/save_DataFrame.csv not found